from string import Template

# =========================
# RAG PROMPTS
# =========================


# System Prompt

system_prompt = Template("\n".join([
    "أنت مساعد مسؤول عن إنشاء إجابة مناسبة للمستخدم.",
    "سيتم تزويدك بمجموعة من المستندات المرتبطة باستفسار المستخدم.",
    "يجب عليك إنشاء الإجابة بالاعتماد فقط على المعلومات الموجودة في المستندات المقدمة.",
    "تجاهل المستندات أو المعلومات غير المرتبطة باستفسار المستخدم.",
    "إذا لم تتوفر معلومات كافية للإجابة، اعتذر للمستخدم بوضوح.",
    "يجب أن تكون الإجابة باللغة نفسها التي استخدمها المستخدم في استفساره.",
    "كن مهذبًا ومحترمًا في إجابتك.",
    "اجعل إجابتك دقيقة ومختصرة.",
    "تجنب إضافة معلومات غير ضرورية أو غير موجودة في المستندات."
]))


# Document Prompt

document_prompt = Template(
    "\n".join([
        "## المستند رقم: $doc_num",
        "### المحتوى: $chunk_text",
    ])
)


# Footer Prompt

footer_prompt = Template(
    "\n".join([
        "اعتمادًا فقط على المستندات المذكورة أعلاه، أنشئ إجابة مناسبة لاستفسار المستخدم.",
        "إذا لم تكن المستندات تحتوي على الإجابة، وضّح أن المعلومات المتوفرة غير كافية.",
        "## السؤال:  ",
        "$query",
        " ",
        "## الإجابة:",
    ])
)